#! /bin/sh
#
# csv2lfv.sh
#    CSV(Excel形式:ダブルクォーテーションのエスケープは"")から
#    行番号列番号インデックス付き値ファイルへの変換器
#
# Usage: csv2lfv.sh [CSV_file]
#
# Written by Rich Mikan(richmikan[at]richlab.org) / Date : Aug 4, 2012

ACK=$(printf '\006')             # 1列1行化後に元々の改行を示すための印
NAK=$(printf '\025')             # (未使用)
ESC=$(printf '\033')             # ダブルクォーテーション*2のエスケープ印
LF=$(printf '\\\n_');LF=${LF%_}  # SED内で改行を変数として扱うためのもの

if [ -f "$1" ]; then
  file=$1
elif [ "_$1" = "_" ]; then
  file=/dev/stdin
else
  echo "Usage : $0 [CSV_file]" > /dev/stderr
  exit 1
fi

# === データの流し込み ============================================= #
cat "$file"                                                          |
#                                                                    #
# === 値としてのダブルクォーテーションをエスケープ ================= #
#     (但しnull囲みの""も区別が付かず、エスケープされる)             #
sed "s/\"\"/$ESC/g"                                                  |
#                                                                    #
# === 値としての改行を\nに変換 ===================================== #
#     (ダブルクォーテーションの数が奇数個なら次の行と結合する)       #
#     (実際の改行が1列1行化後に区別がつくようにACK行を挿入する)      #
awk '                                                                \
  {                                                                  \
    s=$0;                                                            \
    gsub(/[^"]/,"",s);                                               \
    if (((length(s)+cy) % 2)==0) {                                   \
      cy=0;                                                          \
      printf("%s\n'$ACK'\n",$0);                                     \
    } else {                                                         \
      cy=1;                                                          \
      printf("%s\\n",$0);                                            \
    }                                                                \
  }                                                                  \
'                                                                    |
#                                                                    #
# === ダブルクォーテーション囲み列の(前後のスペース外し&1列1行化) == #
# (1/3)先頭からNF-1までのもの外す                                    #
sed "s/[[:blank:]]*\(\"[^\"]*\"\)[[:blank:]]*,/\1$LF/g"              |
# (2/3)NFのものを外す                                                #
sed "s/,[[:blank:]]*\(\"[^\"]*\"\)[[:blank:]]*$/$LF\1/g"             |
# (3/3)残った前後のスペースは改めて外す                              #
sed "s/^[[:blank:]]*\(\"[^\"]*\"\)[[:blank:]]*$/\1/g"                |
#                                                                    #
# === 残り列の1列1行化、及び"～"の中身を残して囲みを外す =========== #
awk '                                                                \
  {                                                                  \
    if ($0=="'$ACK'")             {                                  \
      # do nothing                                                   \
    } else if (index($0,"\"")==0) {                                  \
      gsub(/,/,"\n",$0);                                             \
    } else                        {                                  \
      gsub(/"/,"",  $0);                                             \
    }                                                                \
    printf("%s\n",$0);                                               \
  }                                                                  \
'                                                                    |
#                                                                    #
# === エスケープしてたダブルクォーテーションを戻す ================= #
# (1/3)まずは""に戻す                                                #
sed "s/$ESC/\"\"/g"                                                  |
# (2/3)null囲みの""だった場合はそれを空行に変換する                  #
sed 's/^[[:space:]]*""[[:space:]]*$//'                               |
# (3/3)""を単純な"に戻す                                             #
sed 's/""/"/g'                                                       |
tee 1f1l |
#                                                                    #
# === 先頭に行番号と列番号をつける ================================= #
awk '                                                                \
  BEGIN{                                                             \
    l=1;                                                             \
    f=1;                                                             \
  }                                                                  \
  {                                                                  \
    if ($0=="'$ACK'") {                                              \
      l++;                                                           \
      f=1;                                                           \
    } else {                                                         \
      printf("%d %d %s\n",l,f,$0);                                   \
      f++;                                                           \
    }                                                                \
  }                                                                  \
'